           77 WRK-VENDAS       PIC 9(06)V99    VALUE ZEROS.
           77 WRK-QTD          PIC 9(02)       VALUE ZEROS.
           77 WRK-TOTAL        PIC 9(06)V99    VALUE ZEROS.
